{"input": "What does Section 6 of the IPC state?", "target": "Section 6 of the IPC states that every definition of an offense, penal provision, and illustration must be understood subject to the exceptions in the chapter titled 'General Exceptions,' even if those exceptions are not repeated in each case."}
{"input": "What is the purpose of Section 6 in the IPC?", "target": "Section 6 avoids the need to repeat lengthy exceptions in every offense definition, ensuring all offenses are read subject to the General Exceptions in Chapter IV (Sections 76–106 IPC)."}
{"input": "Who bears the burden of proving the existence of General Exceptions in a case?", "target": "The burden of proving the existence of circumstances that fall under General Exceptions lies on the accused, as per Section 6 IPC and Section 105 of the Evidence Act, 1872."}
{"input": "What is an example of a General Exception under the IPC?", "target": "An example is that a child under seven years of age cannot commit an offense, as stated in Chapter IV of the IPC."}
{"input": "What happens if an act falls under the General Exceptions?", "target": "If an act falls under any General Exception, the accused is entitled to its benefit, even if the exception is not explicitly mentioned in the offense description."}
{"input": "What is the court's obligation under Section 6 regarding legal insanity?", "target": "The court must consider the case for legal insanity (e.g., Section 84 IPC) on its own, ensuring the accused’s mental condition at the time of the act is evaluated."}
{"input": "How does Section 6 relate to Section 105 of the Evidence Act?", "target": "Section 6 of the IPC works as a proviso to Section 105 of the Evidence Act, ensuring that the burden to prove General Exceptions lies with the accused, while the court presumes their absence unless proven otherwise."}
{"input": "What illustration explains Section 6 regarding General Exceptions?", "target": "One illustration states that a child under seven years cannot commit an offense, aligning with the general exception for children."}
{"input": "Does Section 6 apply universally to all IPC offenses?", "target": "Yes, Section 6 applies universally to all offenses defined in the IPC, making General Exceptions integral to every offense."}
{"input": "What case law supports the interpretation of Section 6 IPC?", "target": "Cases like Shankar Narayan Bhadolkar v State of Maharashtra (AIR 2004 SC 1966) and Abdul Latif v State of Assam (1981 Cr LJ 1205) provide guidance on the application of Section 6 IPC."}
