{"input": "Who is liable to punishment under the IPC within India?", "target": "Every person is liable to punishment under the IPC for acts or omissions contrary to its provisions, committed within India, regardless of nationality, rank, caste, or creed."}
{"input": "How does Section 2 of the IPC relate to its application?", "target": "Section 2 deals with the intraterritorial operation of the IPC, making it applicable to all persons committing offenses within India."}
{"input": "Does the IPC apply to foreigners committing offenses in India?", "target": "Yes, foreigners who commit offenses within India are liable under the IPC, even if they were unaware the act was an offense in their own country."}
{"input": "Can Indian courts have jurisdiction over acts by foreigners outside India?", "target": "Indian courts can have jurisdiction over foreigners residing abroad if their acts are connected to a transaction or part of a transaction arising in India."}
{"input": "What happens if an offense targets a computer resource located in India but is committed outside India?", "target": "By a 2009 amendment, the IPC applies to offenses committed outside India targeting a computer resource located in India."}
{"input": "Are companies liable for criminal offenses under the IPC?", "target": "Yes, companies can be prosecuted and punished for criminal offenses, including those where mandatory imprisonment and fine are prescribed."}
{"input": "How can companies be punished if mandatory imprisonment is part of the penalty?", "target": "When mandatory imprisonment and fine are prescribed, courts can impose only the fine, enforceable against the company."}
{"input": "What does the IPC say about the liability of a foreigner unaware of Indian laws?", "target": "A foreigner who commits an offense in India cannot use ignorance of Indian laws as a defense; they are still liable under the IPC."}
{"input": "What is the modern rule regarding corporate criminal liability under the IPC?", "target": "The modern rule is that corporations can be subject to indictment and criminal processes, even if the crime is committed through their agents."}
{"input": "How does the IPC ensure universal applicability within India?", "target": "The IPC ensures universal applicability by making all persons, irrespective of their background, liable for acts or omissions contrary to its provisions within India."}
