{"input": "What does Section 5 of the IPC state?", "target": "Section 5 of the IPC ensures that the provisions of the IPC do not affect special or local laws or laws punishing mutiny and desertion among armed forces personnel, such as the Army Act, 1950, the Navy Act, 1957, and the Indian Air Force Act, 1950."}
{"input": "Does the IPC affect the Army, Navy, and Air Force Acts?", "target": "No, the IPC does not affect the provisions of the Army Act, 1950, the Navy Act, 1957, and the Air Force Act, 1950, which govern mutiny and desertion offenses among their personnel."}
{"input": "What is the difference between a special law and a local law?", "target": "A special law relates to a specific subject, while a local law applies to only a particular region or part of the country."}
{"input": "Can a person be punished under both the IPC and a special law for the same offense?", "target": "No, a person cannot be punished under both the IPC and a special law for the same offense. Ordinarily, the sentence should be under the special law when the offenses overlap."}
{"input": "What is the guideline for interpreting general law and special law?", "target": "Courts should try to harmoniously apply both laws. If inconsistency persists, the prior special law prevails over the later general law unless the later general law shows a clear intention to override the special law."}
{"input": "Which law prevails when there is inconsistency between a general and a special law?", "target": "If inconsistency remains, the prior special law usually prevails unless the later general law explicitly intends to supersede it. Conversely, a later special law prevails over an earlier general law."}
{"input": "What does the Contempt of Courts Act, 1971, define?", "target": "The Contempt of Courts Act, 1971, defines 'Contempt of Court' as either 'Civil contempt,' meaning willful disobedience to judgments, or 'Criminal contempt,' involving acts that scandalize or lower the authority of the court."}
{"input": "What is civil contempt under the Contempt of Courts Act, 1971?", "target": "'Civil contempt' is defined as willful disobedience to any judgment, decree, or order of the court under the Contempt of Courts Act, 1971."}
{"input": "What is the principle for creating new offenses under special laws?", "target": "When a new offense is created with a specific penalty, it must be punished only as per the procedure defined in that law. The IPC does not apply if the procedure differs."}
{"input": "What are some examples of laws unaffected by the IPC?", "target": "Examples include the Army Act, 1950, the Navy Act, 1957, and the Air Force Act, 1950, which govern armed forces personnel for offenses like mutiny and desertion."}
