{"input": "Question: What is the full title of the IPC, and to which areas does it apply?", "target": "The full title of the IPC is the Indian Penal Code. It extends to the whole of India, except for the State of Jammu and Kashmir (as per the original text, but this has changed after the abrogation of Article 370)."}
{"input": "Question: What legal systems were followed in India before the IPC was enacted?", "target": "Before the IPC, English criminal law, modified by several Acts, was applied in the Presidency towns of Bombay, Calcutta, and Madras. In the mofussil areas, Mohammedan criminal law was followed, with some modifications by local regulations."}
{"input": "Question: When and where was the judicial system of Bombay revised before the IPC's introduction?", "target": "The judicial system of Bombay was thoroughly revised in 1827, and a Regulation was introduced to define offences and specify punishments."}
{"input": "Question: Under which code are offences under the IPC tried and investigated?", "target": "Offences under the IPC are investigated, inquired into, and tried according to the provisions of the Code of Criminal Procedure, 1973 (CrPC)."}
{"input": "Question: What happens in cases of overlapping offences between the IPC and other laws?", "target": "The Supreme Court has held that overlapping offences in the IPC and other laws do not prevent an offender from being tried under the IPC. Courts decide based on the evidence, as overlapping facts do not necessarily mean the offences are identical."}
{"input": "Question: How does the IPC distinguish between a terrorist act and waging war against the Government of India?", "target": "While a terrorist act and an act of waging war against the Government of India may have overlapping features, they are distinct. A terrorist act does not always constitute waging war against the Government, and vice versa."}
{"input": "Question: Which act governs offences related to terrorism, and how does it differ from the IPC?", "target": "The Unlawful Activities (Prevention) Act, 1967 governs offences related to terrorism, covering different aspects compared to the IPC, particularly offences under Chapter IV of UAPA and Chapter VI of the IPC."}
{"input": "Question: Can an offence covered by the Customs Act, 1962, also be tried under the IPC?", "target": "Yes, an offence covered by the Customs Act, 1962, can also be tried under the IPC if it meets the criteria for offences under the IPC."}
{"input": "Question: What is the significance of Section 420 IPC and its overlap with Section 138 of the Negotiable Instruments Act, 1881?", "target": "While Section 420 IPC (cheating) and Section 138 of the Negotiable Instruments Act (dishonored cheques) may overlap in facts, their ingredients differ. Cases under both sections can proceed independently."}
{"input": "Question: What is the historical importance of the IPC in the evolution of criminal law in India?", "target": "The IPC marked the unification of criminal laws across India, replacing the English and Mohammedan laws previously followed in different regions. It provided a consistent framework for criminal justice."}
