{"input": "What does Section 3 of the IPC deal with?", "target": "Section 3 of the IPC addresses the punishment of offenses committed beyond India but which can be tried under Indian law, treating such acts as if committed within India."}
{"input": "What is required for an offense committed outside India to be punishable under the IPC?", "target": "For an offense committed outside India to be punishable under the IPC, it must be an offense under Indian law, and the person must be amenable to Indian courts at the time of the act."}
{"input": "Can an Indian citizen committing an offense abroad be tried in India if the act is not an offense in the foreign country?", "target": "Yes, an Indian citizen committing an offense abroad can be tried in India if the act is an offense under Indian law, even if it is not an offense in the foreign country."}
{"input": "What happens if the police refuse to register an FIR for a crime committed abroad by an Indian citizen?", "target": "If the police refuse to register an FIR for a crime committed abroad by an Indian citizen, courts can direct them to register the crime and investigate it under Section 3 of the IPC."}
{"input": "How does the IPC apply to marital offenses committed abroad by Indian citizens?", "target": "Marital offenses committed abroad, such as cruelty by an Indian husband, can be tried under Indian law if both spouses are Indian citizens."}
{"input": "What is the relationship between Section 3 of the IPC and the Extradition Act, 1962?", "target": "The operation of Section 3 of the IPC is restricted to cases specified under the Extradition Act, 1962, and relevant sections of the CrPC, such as Sections 188 and 189."}
{"input": "Can local police investigate offenses committed abroad without Central Government sanction?", "target": "Yes, local police can investigate offenses committed abroad by Indian citizens without prior sanction of the Central Government, as held in a series of legal cases."}
{"input": "What legal assumption does Section 3 of the IPC rely on for practical application?", "target": "Section 3 of the IPC relies on the legal fiction that an offense committed outside India can be treated as if committed within India for practical purposes."}
{"input": "Is participating in a child marriage abroad punishable under Indian law?", "target": "No, participating in a child marriage abroad by an Indian citizen is not punishable under Indian law, as the Child Marriage Restraint Act, 1929 does not apply extraterritorially."}
{"input": "What did the courts observe about Section 3 of the IPC in cases of murder committed abroad?", "target": "Courts observed that Section 3 of the IPC allows Indian authorities to treat offenses committed abroad, such as murder, as if they were committed within India for legal proceedings."}
