{"input": "What is the scope of Section 4 of the Indian Penal Code (IPC)?", "target": "Section 4 of the IPC extends the Code's application to offenses committed outside India. It applies to: (1) any Indian citizen committing an offense outside India, (2) any person on a ship or aircraft registered in India, wherever it may be, and (3) any person, regardless of nationality, committing an offense targeting a computer resource located in India."}
{"input": "What does 'offense' mean under Section 4 of the IPC?", "target": "The term 'offense' under Section 4 includes any act committed outside India that would be punishable under the IPC if committed within India."}
{"input": "What does the term 'computer resource' refer to under Section 4?", "target": "The term 'computer resource' under Section 4 is defined as per clause (k) of subsection (1) of Section 2 of the Information Technology Act, 2000."}
{"input": "Can a citizen of India be tried for an offense committed outside India?", "target": "Yes, a citizen of India who commits an offense outside India can be tried under the IPC if the act is punishable under Indian law."}
{"input": "Does Section 4 apply to offenses on Indian-registered ships or aircraft?", "target": "Yes, Section 4 applies to any person committing an offense on ships or aircraft registered in India, regardless of their location."}
{"input": "What is the role of Section 188 of the CrPC in extraterritorial offenses?", "target": "Section 188 of the CrPC provides procedural jurisdiction for offenses committed outside India. It allows for the trial of (a) Indian citizens for offenses committed abroad, and (b) anyone on Indian-registered ships or aircraft, treating the offenses as if committed within India."}
{"input": "Can an Indian citizen be tried for an act committed abroad that is not an offense in that country?", "target": "Yes, an Indian citizen can be tried in India for an act committed abroad if it is considered an offense under Indian law, regardless of its legality in the foreign country."}
{"input": "What are the two methods for dealing with an offender who committed a crime outside India?", "target": "(1) Extradition to the country where the offense was committed, or (2) trial under Indian extraterritorial jurisdiction if the conditions of the IPC and CrPC are met."}
{"input": "What is extradition under Indian law?", "target": "Extradition is the process by which one country surrenders a person accused or convicted of a crime to another country for trial or punishment, as governed by the Extradition Act, 1962, in India."}
{"input": "What is the difference between extraterritorial jurisdiction and extradition?", "target": "Extraterritorial jurisdiction allows Indian courts to try certain offenses committed outside India. Extradition, on the other hand, involves surrendering the accused to the country where the offense occurred, as per treaties or agreements."}
